MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GM304/mcu.h
/* CRCXORH */
#define _X16 CRCXORHbits.X16
#define _X17 CRCXORHbits.X17
#define _X18 CRCXORHbits.X18
#define _X19 CRCXORHbits.X19
#define _X20 CRCXORHbits.X20
#define _X21 CRCXORHbits.X21
#define _X22 CRCXORHbits.X22
#define _X23 CRCXORHbits.X23
#define _X24 CRCXORHbits.X24
#define _X25 CRCXORHbits.X25
#define _X26 CRCXORHbits.X26
#define _X27 CRCXORHbits.X27
#define _X28 CRCXORHbits.X28
#define _X29 CRCXORHbits.X29
#define _X30 CRCXORHbits.X30
#define _X31 CRCXORHbits.X31

/* RPOR0 */
#define _RP20R RPOR0bits.RP20R
#define _RP35R RPOR0bits.RP35R
#define _RP20R0 RPOR0bits.RP20R0
#define _RP20R1 RPOR0bits.RP20R1
#define _RP20R2 RPOR0bits.RP20R2
#define _RP20R3 RPOR0bits.RP20R3
#define _RP20R4 RPOR0bits.RP20R4
#define _RP20R5 RPOR0bits.RP20R5
#define _RP35R0 RPOR0bits.RP35R0
#define _RP35R1 RPOR0bits.RP35R1
#define _RP35R2 RPOR0bits.RP35R2
#define _RP35R3 RPOR0bits.RP35R3
#define _RP35R4 RPOR0bits.RP35R4
#define _RP35R5 RPOR0bits.RP35R5

/* RPOR1 */
#define _RP36R RPOR1bits.RP36R
#define _RP37R RPOR1bits.RP37R
#define _RP36R0 RPOR1bits.RP36R0
#define _RP36R1 RPOR1bits.RP36R1
#define _RP36R2 RPOR1bits.RP36R2
#define _RP36R3 RPOR1bits.RP36R3
#define _RP36R4 RPOR1bits.RP36R4
#define _RP36R5 RPOR1bits.RP36R5
#define _RP37R0 RPOR1bits.RP37R0
#define _RP37R1 RPOR1bits.RP37R1
#define _RP37R2 RPOR1bits.RP37R2
#define _RP37R3 RPOR1bits.RP37R3
#define _RP37R4 RPOR1bits.RP37R4
#define _RP37R5 RPOR1bits.RP37R5

/* RPOR2 */
#define _RP38R RPOR2bits.RP38R
#define _RP39R RPOR2bits.RP39R
#define _RP38R0 RPOR2bits.RP38R0
#define _RP38R1 RPOR2bits.RP38R1
#define _RP38R2 RPOR2bits.RP38R2
#define _RP38R3 RPOR2bits.RP38R3
#define _RP38R4 RPOR2bits.RP38R4
#define _RP38R5 RPOR2bits.RP38R5
#define _RP39R0 RPOR2bits.RP39R0
#define _RP39R1 RPOR2bits.RP39R1
#define _RP39R2 RPOR2bits.RP39R2
#define _RP39R3 RPOR2bits.RP39R3
#define _RP39R4 RPOR2bits.RP39R4
#define _RP39R5 RPOR2bits.RP39R5

/* RPOR3 */
#define _RP40R RPOR3bits.RP40R
#define _RP41R RPOR3bits.RP41R
#define _RP40R0 RPOR3bits.RP40R0
#define _RP40R1 RPOR3bits.RP40R1
#define _RP40R2 RPOR3bits.RP40R2
#define _RP40R3 RPOR3bits.RP40R3
#define _RP40R4 RPOR3bits.RP40R4
#define _RP40R5 RPOR3bits.RP40R5
#define _RP41R0 RPOR3bits.RP41R0
#define _RP41R1 RPOR3bits.RP41R1
#define _RP41R2 RPOR3bits.RP41R2
#define _RP41R3 RPOR3bits.RP41R3
#define _RP41R4 RPOR3bits.RP41R4
#define _RP41R5 RPOR3bits.RP41R5

/* RPOR4 */
#define _RP42R RPOR4bits.RP42R
#define _RP43R RPOR4bits.RP43R
#define _RP42R0 RPOR4bits.RP42R0
#define _RP42R1 RPOR4bits.RP42R1
#define _RP42R2 RPOR4bits.RP42R2
#define _RP42R3 RPOR4bits.RP42R3
#define _RP42R4 RPOR4bits.RP42R4
#define _RP42R5 RPOR4bits.RP42R5
#define _RP43R0 RPOR4bits.RP43R0
#define _RP43R1 RPOR4bits.RP43R1
#define _RP43R2 RPOR4bits.RP43R2
#define _RP43R3 RPOR4bits.RP43R3
#define _RP43R4 RPOR4bits.RP43R4
#define _RP43R5 RPOR4bits.RP43R5

/* RPOR5 */
#define _RP48R RPOR5bits.RP48R
#define _RP49R RPOR5bits.RP49R
#define _RP48R0 RPOR5bits.RP48R0
#define _RP48R1 RPOR5bits.RP48R1
#define _RP48R2 RPOR5bits.RP48R2
#define _RP48R3 RPOR5bits.RP48R3
#define _RP48R4 RPOR5bits.RP48R4
#define _RP48R5 RPOR5bits.RP48R5
#define _RP49R0 RPOR5bits.RP49R0
#define _RP49R1 RPOR5bits.RP49R1
#define _RP49R2 RPOR5bits.RP49R2
#define _RP49R3 RPOR5bits.RP49R3
#define _RP49R4 RPOR5bits.RP49R4
#define _RP49R5 RPOR5bits.RP49R5

/* RPOR6 */
#define _RP54R RPOR6bits.RP54R
#define _RP55R RPOR6bits.RP55R
#define _RP54R0 RPOR6bits.RP54R0
#define _RP54R1 RPOR6bits.RP54R1
#define _RP54R2 RPOR6bits.RP54R2
#define _RP54R3 RPOR6bits.RP54R3
#define _RP54R4 RPOR6bits.RP54R4
#define _RP54R5 RPOR6bits.RP54R5
#define _RP55R0 RPOR6bits.RP55R0
#define _RP55R1 RPOR6bits.RP55R1
#define _RP55R2 RPOR6bits.RP55R2
#define _RP55R3 RPOR6bits.RP55R3
#define _RP55R4 RPOR6bits.RP55R4
#define _RP55R5 RPOR6bits.RP55R5

/* RPOR7 */
#define _RP56R RPOR7bits.RP56R
#define _RP57R RPOR7bits.RP57R
#define _RP56R0 RPOR7bits.RP56R0
#define _RP56R1 RPOR7bits.RP56R1
#define _RP56R2 RPOR7bits.RP56R2
#define _RP56R3 RPOR7bits.RP56R3
#define _RP56R4 RPOR7bits.RP56R4
#define _RP56R5 RPOR7bits.RP56R5
#define _RP57R0 RPOR7bits.RP57R0
#define _RP57R1 RPOR7bits.RP57R1
#define _RP57R2 RPOR7bits.RP57R2
#define _RP57R3 RPOR7bits.RP57R3
#define _RP57R4 RPOR7bits.RP57R4
#define _RP57R5 RPOR7bits.RP57R5

/* RPOR8 */
#define _RP69R RPOR8bits.RP69R
#define _RP70R RPOR8bits.RP70R
#define _RP69R0 RPOR8bits.RP69R0
#define _RP69R1 RPOR8bits.RP69R1
#define _RP69R2 RPOR8bits.RP69R2
#define _RP69R3 RPOR8bits.RP69R3
#define _RP69R4 RPOR8bits.RP69R4
#define _RP69R5 RPOR8bits.RP69R5
#define _RP70R0 RPOR8bits.RP70R0
#define _RP70R1 RPOR8bits.RP70R1
#define _RP70R2 RPOR8bits.RP70R2
#define _RP70R3 RPOR8bits.RP70R3
#define _RP70R4 RPOR8bits.RP70R4
#define _RP70R5 RPOR8bits.RP70R5

/* RPOR9 */
#define _RP81R RPOR9bits.RP81R
#define _RP97R RPOR9bits.RP97R
#define _RP81R0 RPOR9bits.RP81R0
#define _RP81R1 RPOR9bits.RP81R1
#define _RP81R2 RPOR9bits.RP81R2
#define _RP81R3 RPOR9bits.RP81R3
#define _RP81R4 RPOR9bits.RP81R4
#define _RP81R5 RPOR9bits.RP81R5
#define _RP97R0 RPOR9bits.RP97R0
#define _RP97R1 RPOR9bits.RP97R1
#define _RP97R2 RPOR9bits.RP97R2
#define _RP97R3 RPOR9bits.RP97R3
#define _RP97R4 RPOR9bits.RP97R4
#define _RP97R5 RPOR9bits.RP97R5

/* RPOR10 */
#define _RP113R RPOR10bits.RP113R
#define _RP118R RPOR10bits.RP118R
#define _RP113R0 RPOR10bits.RP113R0
#define _RP113R1 RPOR10bits.RP113R1
#define _RP113R2 RPOR10bits.RP113R2
#define _RP113R3 RPOR10bits.RP113R3
#define _RP113R4 RPOR10bits.RP113R4
#define _RP113R5 RPOR10bits.RP113R5
#define _RP118R0 RPOR10bits.RP118R0
#define _RP118R1 RPOR10bits.RP118R1
#define _RP118R2 RPOR10bits.RP118R2
#define _RP118R3 RPOR10bits.RP118R3
#define _RP118R4 RPOR10bits.RP118R4
#define _RP118R5 RPOR10bits.RP118R5

/* RPOR11 */
#define _RP120R RPOR11bits.RP120R
#define _RP125R RPOR11bits.RP125R
#define _RP120R0 RPOR11bits.RP120R0
#define _RP120R1 RPOR11bits.RP120R1
#define _RP120R2 RPOR11bits.RP120R2
#define _RP120R3 RPOR11bits.RP120R3
#define _RP120R4 RPOR11bits.RP120R4
#define _RP120R5 RPOR11bits.RP120R5
#define _RP125R0 RPOR11bits.RP125R0
#define _RP125R1 RPOR11bits.RP125R1
#define _RP125R2 RPOR11bits.RP125R2
#define _RP125R3 RPOR11bits.RP125R3
#define _RP125R4 RPOR11bits.RP125R4
#define _RP125R5 RPOR11bits.RP125R5

/* RPOR12 */
#define _RP126R RPOR12bits.RP126R
#define _RP127R RPOR12bits.RP127R
#define _RP126R0 RPOR12bits.RP126R0
#define _RP126R1 RPOR12bits.RP126R1
#define _RP126R2 RPOR12bits.RP126R2
#define _RP126R3 RPOR12bits.RP126R3
#define _RP126R4 RPOR12bits.RP126R4
#define _RP126R5 RPOR12bits.RP126R5
#define _RP127R0 RPOR12bits.RP127R0
#define _RP127R1 RPOR12bits.RP127R1
#define _RP127R2 RPOR12bits.RP127R2
#define _RP127R3 RPOR12bits.RP127R3
#define _RP127R4 RPOR12bits.RP127R4
#define _RP127R5 RPOR12bits.RP127R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6

